Autodesk.Revit.UI.UIFabricationUtils.RebuildLoadedDatabase(Autodesk.Revit.DB.Document)
we need the for fabrication setting form when user clicked sync with source and cancel the form. when the interal rebuildLoadedDatabase is not called
because transaction was rolled back, but we need the reload the workspace
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.IsAllowedToPlacePart(Autodesk.Revit.DB.Document)
Checks if placing part is allowed or not.
For example, plaing part is not allowed if the document is not allowed to change.
doc:
The document.
Returns:
True if placing part is allowed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.PlaceFabricationPart(Autodesk.Revit.DB.FabricationServiceButton)
Call to place a fabrication part.
serviceButton:
The Fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentException:
checks the service id, tab index and button index and makes sure they are valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016